In [58]:
import pandas as pd

In [59]:
movies = pd.read_csv('movies.csv', index_col='Title')
movies

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [60]:
movies.head(4)

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015

In [61]:
movies.tail(3)

                          Rank           Studio     Gross  Year
Title
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [62]:
len(movies)

782

In [63]:
movies.shape

(782, 4)

In [64]:
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

### Obtener una fila por nÃºmero de indice

In [65]:
movies.iloc[100:102]

,Rank,Studio,Gross,Year
Title,,,,
Suicide Squad,101,Warner Brothers,$746.80,2016
"The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",102,Buena Vista,$745.00,2005

In [66]:
movies.loc["Forrest Gump"]

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [67]:
movies.sort_values(by="Year", ascending=False).head(3)

                                   Rank           Studio       Gross  Year
Title
Avengers: Endgame                     1      Buena Vista  $2,796.30   2019
Shazam!                             340  Warner Brothers    $364.10   2019
John Wick: Chapter 3 - Parabellum   458        Lionsgate    $304.70   2019

In [68]:
movies.sort_values(by=["Studio", "Year"], ascending=[True, False]).head()

                         Rank       Studio       Gross  Year
Title
The Blair Witch Project   588      Artisan    $248.60   1999
Avengers: Endgame           1  Buena Vista  $2,796.30   2019
Captain Marvel             22  Buena Vista  $1,128.30   2019
Aladdin                    59  Buena Vista    $880.20   2019
Toy Story 4               198  Buena Vista    $519.80   2019

In [69]:
movies.sort_index(ascending=False).head()

                                Rank           Studio       Gross  Year
Title
xXx: The Return of Xander Cage   385        Paramount    $346.10   2017
Zootopia                          37      Buena Vista  $1,023.80   2016
Your Name.                       356              FUN    $358.00   2017
You've Got Mail                  582  Warner Brothers    $250.80   1998
Yogi Bear                        778  Warner Brothers    $201.60   2010

In [70]:
studios = movies["Studio"]
studios.value_counts()
# len(studios.value_counts())

Studio
Warner Brothers           132
Buena Vista               125
Fox                       117
Universal                 109
Sony                       86
Paramount                  76
Dreamworks                 27
Lionsgate                  21
New Line                   16
MGM                        11
TriStar                    11
Miramax                    10
Weinstein                   6
Columbia                    5
WGUSA                       4
SonR                        2
Orion                       2
Polygram                    2
Dimension                   2
HC                          1
China Film Corporation      1
FUN                         1
IFC                         1
FR                          1
Newmarket                   1
UTV                         1
RKO                         1
GrtIndia                    1
Artisan                     1
Pathe                       1
CL                          1
Rela.                       1
Lions                       1
Vestron                     1
USA                         1
Focus                       1
Magn.                       1
Name: count, dtype: int64

### 1.3.4 Filtering a column by one or more criteria

In [71]:
# movies["Studio"] == "Universal" # Series of booleans
released_by_universal = movies["Studio"] == "Universal"
movies[released_by_universal]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [77]:
# AND 2nd condition
# released_by_universal & released_in_2016 # returns a Series of booleans
released_in_2016 = movies["Year"] == 2016
movies[released_by_universal & released_in_2016]

                         Rank     Studio     Gross  Year
Title
The Secret Life of Pets    63  Universal  $875.50   2016
Sing                      134  Universal  $634.20   2016
Warcraft                  257  Universal  $433.70   2016
Jason Bourne              272  Universal  $415.50   2016
Bridget Jones's Baby      733  Universal  $212.00   2016

In [78]:
# OR 2nd condition
movies[released_by_universal | released_in_2016]

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
Everest                          766  Universal    $203.40   2015
Arrival                          768  Paramount    $203.40   2016
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[147 rows x 4 columns]

In [ ]:
studios_with_a =movies["Studio"].str.lower().str.contains("a")
#movies[has_dark_in_title]

Title
Avengers: Endgame                True
Avatar                          False
Titanic                          True
Star Wars: The Force Awakens     True
Avengers: Infinity War           True
                                ...
Yogi Bear                        True
Garfield: The Movie             False
Cats & Dogs                      True
The Hunt for Red October         True
Valkyrie                        False
Name: Studio, Length: 782, dtype: bool